In [29]:
import pandas as pd
from sqlalchemy import create_engine

%matplotlib inline

In [30]:
cnxn_string = "postgresql+psycopg2://{user}:{pswd}" "@{host}:{port}/{database}"
print(cnxn_string)

postgresql+psycopg2://{user}:{pswd}@{host}:{port}/{database}

In [31]:
engine = create_engine(
    cnxn_string.format(
        user="postgres",
        pswd="Phoenix03$",
        host="localhost",
        port="5432",
        database="world",
    )
)

In [32]:
# Test the connection by reading two rows from the country table
df = pd.read_sql_query("SELECT * FROM country LIMIT 2", engine)
df

,code,name,continent,region,surfacearea,indepyear,population,lifeexpectancy,gnp,gnpold,localname,governmentform,headofstate,capital,code2
0,ABW,Aruba ...,North\nAmerica ...,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan\nTerritory of The Netherlands,Beatrix ...,129,AW
1,AFG,Afghanistan ...,Asia ...,Southern and Central\nAsia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic\nEmirate,Mohammad Omar ...,1,AF

In [33]:
conn = engine.connect()

In [34]:
query = """
SELECT country.name AS country,
       COUNT(countrylanguage.language) AS number_of_languages
FROM country
JOIN countrylanguage
  ON country.code = countrylanguage.countrycode
WHERE countrylanguage.isofficial = 'T'
GROUP BY country.name
HAVING COUNT(*) > 2
ORDER BY number_of_languages DESC;
"""

df = pd.read_sql(query, engine)
df

                                             country  number_of_languages
0  Switzerland                                   ...                    4
1  South Africa                                  ...                    4
2  Vanuatu                                       ...                    3
3  Belgium                                       ...                    3
4  Luxembourg                                    ...                    3
5  Peru                                          ...                    3
6  Bolivia                                       ...                    3
7  Singapore                                     ...                    3